app/app/Controllers/AssessmentController.php

    public function index()
    {
        $userModel = new UserModel();
        $assessmentModel = new AssessmentModel();

        $input = $this->request->getJSON();
        $email = $input->email ?? null;
        $password = $input->password ?? null;
        $responses = $input->responses ?? null;

        // Login
        if (!$email || !$password) {
            return $this->fail('Email and password are required.');
        }

        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'yasra@example.com'
 LIMIT 1

                'created_at' => date('Y-m-d H:i:s'),
            ];

            if ($assessmentModel->save($data)) {
---
INSERT INTO `assessments` (`user_id`, `responses`, `score`, `created_at`, `updated_at`) VALUES ('1', '[5,5,5,5,5]', 100, '2025-01-09 06:42:13', '2025-01-09 06:42:13')

    public function result()
    {
        $assessmentModel = new AssessmentModel();

        // Get user_id dari query string
        $userId = $this->request->getGet('user_id');

        // Validasi user_id
        if (!$userId || !is_numeric($userId)) {
            return $this->failValidationError('Invalid or missing user_id');
        }

        // Ambil hasil assessment terbaru untuk user
        $result = $assessmentModel
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->first();
---
SELECT *
FROM `assessments`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 1

    public function updateResult()
    {
        $userModel = new UserModel();
        $assessmentModel = new AssessmentModel();

        $input = $this->request->getJSON();
        $email = $input->email ?? null;
        $password = $input->password ?? null;
        $responses = $input->responses ?? null;

        // Validasi input
        if (!$email || !$password || !$responses) {
            return $this->failValidationError('Email, password, and responses are required.');
        }

        // Validasi user
        $user = $userModel->where('email', $email)->first();
        if (!$user || !password_verify($password, $user['password'])) {
            return $this->failUnauthorized('Invalid email or password.');
        }

        // Validasi responses
        if (!is_array($responses) || count($responses) !== 5) {
            return $this->failValidationError('Responses must be an array of 5 answers.');
        }

        $score = array_sum($responses) * 4;

        // Cek apakah sudah ada data sebelumnya
        $existingResult = $assessmentModel->where('user_id', $user['id'])->orderBy('created_at', 'DESC')->first();
---
SELECT *
FROM `users`
WHERE `email` = 'yasra@example.com'
 LIMIT 1
SELECT *
FROM `assessments`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 1

                'created_at' => date('Y-m-d H:i:s'),
            ];

            if ($assessmentModel->save($data)) {
---
UPDATE `assessments` SET `responses` = '[3,5,5,5,5]', `score` = 92, `created_at` = '2025-01-09 06:49:50', `updated_at` = '2025-01-09 06:49:50'
WHERE `assessments`.`id` IN ('10')